#1)დაწერეთ პითონის პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს ორი რიცხვი და შემდეგ დაბეჭდოს მათი ჯამი.

num1 = int(input("enter first number: "))
num2 = int(input("enter second number: "))

print(num1 + num2)

#2)დაწერეთ პითონის პროგრამა, რომელიც ითვლის მართკუთხედის ფართობს. პროგრამამ უნდა სთხოვოს მომხმარებელს მართკუთხედის სიგანე და სიმაღლე.

num1 = int(input("enter rectangle height: "))
num2 = int(input("enter rectangle width: "))

print(num1 * num2)


#3)დაწერეთ პითონის პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს რიცხვი და შემდეგ დაბეჭდოს ამ რიცხვის ორმაგი.


num1 = int(input("enter number: "))

print(num1 * 2)

#4დაწერეთ პითონის პროგრამა, რომელიც ითვლის მართკუთხედის პერიმეტრს. პროგრამამ უნდა სთხოვოს მომხმარებელს მართკუთხედის სიგანე და სიმაღლე.

num1 = int(input("enter rectangle height: "))
num2 = int(input("enter rectangle width: "))

print(num1 * 2 + num2 * 2)

#5)დაწერეთ პითონის პროგრამა, რომელიც მოუწოდებს მომხმარებელს შეიყვანოს რიცხვი და შემდეგ დაბეჭდოს ამ რიცხვის კვადრატი(გამოიყენეთ ** - ოპერატორი)
num1 = int(input("enter number"))

print(num1 ** 2)




