# 2) შექმენით სია და შეიტანეთ 10 სხვადასხვა მონაცემთა ტიპის მნიშვნელობა, შემდეგ 5 მონაცემს  შეუცვალეთ   მნიშვნელობა და შემდეგ დაპრინტეთ მთლიანი სია. 

listn = [1,2,3,4,5,6,7,8,9,10]
listn[2]=65
listn[1]=45
listn[3]=53
listn[4]=17
listn[5]=26
print(listn)


# #3) სიაში ელემენტების ჯამი
# შექმენი სია, რომელიც შეიცავს რიცხვებს. დაწერე კოდი, რომელიც გამოითვლის ამ სიის ელემენტების ჯამს და დაბეჭდავს შედეგს.

print(sum(listn))


# 4) სიის ყველა ელემენტის გაორმაგება
# შექმენი სია რიცხვებით. დაწერე კოდი, რომელიც თითოეული ელემენტის გაორმაგებულ მნიშვნელობას შეიცავს ახალ სიაში და დაბეჭდავს მას.


new_list = []
for i in listn:
    print(i * 2)
    new_list.append(i * 2)
print(new_list)


# 5) სიის ელემენტების გამრავლება
# შექმენი სია რიცხვებით და დაწერე კოდი, რომელიც გამოითვლის სიის ყველა ელემენტის ნამრავლს და დაბეჭდავს შედეგს.


answer = 1
for i in listn:
    answer = answer * i
print(answer)












