# შექმენით ცვლადები სადაც თქვენს შესახებ შეინახავთ ინფორმაიციას და ბოლოში დაბეჭდეთ ყველაფერი ერთ გრძელ წინადადებაში ასევე დაუმატეთ თქვენს კოდს კომენტარები და კომენტარებში ახსენით თითოეული ხაზი კოდი

name = "lasha"
last_name = "abeslamidze"
age = 13
i_live = "batumi (benze)"
My_favorite_sport = "tennis_valleyball"
#აქ მე დავპრინტავ ყველაფერს ჩემს შესახებ და ის გამოისახება ქვემოთ ფანჯარაში დაშორებული და ჩამწკრივებული ერთ ხაზში და ასევე აქ უნდა ჩაწერო ცვლადის სახელი მაგალითად age სხვა შემთხვევაში გამოაჩენდა ეროროს
print(name, last_name, age, i_live, My_favorite_sport)




#დააწექით ზემოთ მარჯვენა კუთხეში სამკუთხედს







#და აქ ფანჯარაში გამოჩნდება ყველაფერი ჩემს შესახებ










