#1დავალება: შექმენით ფუნქცია რომელიც გამოიტანს მხოლოდ ლუწ ინდექსებზე მყოფ რიცხვებს, გამოყენეთ სლაისინგი


def lasha(num1 = 11,num2 = 0):
    for i in range(num1):
        if num2 % 2 == 0:
            print(num2)
        num2 = num2 + 1   
lasha()


# დავალება: შექმენი სია, სადაც ჩაწერთ თამაშების სახელებს, და შემდეგ ამ თამაშების სახელებს ჩანაცვლებთ პროგრამირების ენებით, და შემდეგ დაპრინტავთ ამ სიას.
list1=["pubg","fortnite","minecraft","subway"]
list1[0]="python"
list1[1]="java"
list1[2]="c++"
list1[3]="c"
print(list1)

# დავალება: ეცადეთ შექმნათ ფუნქცია, რომელსაც გადაცემთ პარამეტრს name, შემდეგ კი, ფუნქცის გამოძახების შემდეგ, მიესალმოს მომხმარებელს.(რასაც გადაცემთ name-ს მნიშვნელობას)

  
def greet(name):
    print("hello "+ name)

greet("lasha")



       



























